andyjhf/nrf51822_bluetooth_reader_RC522/App/main.c
return ch;
}

/**@brief       Assert macro callback function.
 *
 * @details     This function will be called in case of an assert in the SoftDevice.
 *
 * @warning     This handler is an example only and does not fit a final product. You need to
 *              analyze how your product is supposed to react in case of Assert.
 * @warning     On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief   Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by this application.
 */
static void leds_init(void)
{
    nrf_gpio_cfg_output(ADVERTISING_LED_PIN_NO);
    nrf_gpio_cfg_output(CONNECTED_LED_PIN_NO);
	
		nrf_gpio_cfg_output(SPI_RST);
}


/**@brief   Function for Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, false);
}


/**@brief   Function for the GAP initialization.
 *
 * @details This function will setup all the necessary GAP (Generic Access Profile)
 *          parameters of the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    
    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief   Function for the Advertising functionality initialization.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;
		
		ble_advdata_manuf_data_t   manuf_specific_data; 
		uint8_t temp;
	
    uint8_t       flags = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    
    ble_uuid_t adv_uuids[] = {{BLE_UUID_NUS_SERVICE, m_nus.uuid_type}};
		
		sd_ble_gap_address_get(&mac_addr);
		for(char i = 0;i<3;i++)
		{
			temp = mac_addr.addr[i];
			mac_addr.addr[i] = mac_addr.addr[5-i];
			mac_addr.addr[5-i] = temp;
		}
		manuf_specific_data.company_identifier = 0x1122;
		manuf_specific_data.data.size = 6;
		manuf_specific_data.data.p_data = mac_addr.addr;
		
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = false;
    advdata.flags.size              = sizeof(flags);
    advdata.flags.p_data            = &flags;
		advdata.p_manuf_specific_data		= &manuf_specific_data;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = adv_uuids;
    
    err_code = ble_advdata_set(&advdata, &scanrsp);
    APP_ERROR_CHECK(err_code);
}
uint32_t ble_nus_send_data(ble_nus_t * p_nus, uint16_t cmdid, uint8_t *data, uint16_t length)
{
	uint32_t       err_code;
  bool           is_indication_enabled;
	
//	err_code = ble_nus_is_indication_enabled(p_nus, &is_indication_enabled);
//  APP_ERROR_CHECK(err_code);

//	if (is_indication_enabled && !m_bps_meas_ind_conf_pending)
	{

		if(p_nus->send_data.endLength > p_nus->send_data.startLength)
			return NRF_ERROR_BUSY;
		memset(p_nus->send_data.data, 0, sizeof(p_nus->send_data.data));
		p_nus->send_data.startLength = 0;
//		p_nus->send_data.sendLength = BLE_NUS_MAX_DATA_LEN;
	//	memcpy(p_nus->send_data.data, data, length);
		wechat_pack_request(cmdid,p_nus->send_data.data,data,length);
		BpFixHead *mBpFixHead = (BpFixHead *)p_nus->send_data.data;
		p_nus->send_data.endLength = BigLittleSwap16(mBpFixHead->nLength);
		return ble_nus_send(p_nus);
	}
}

/**@brief    Function for handling the data from the Nordic UART Service.
 *
 * @details  This function will process the data received from the Nordic UART BLE Service and send
 *           it to the UART module.
 */
/**@snippet [Handling the data received over BLE] */
void nus_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length)
{
	BpFixHead *mBpFixHead = (BpFixHead *)p_nus->recv_data.data;
  if(mBpFixHead->bMagicNumber == 0xfe)
	{
		memcpy(p_nus->recv_data.data, p_data, length);
		p_nus->recv_data.recvLen += length;
		
	
	}
	else
	{
		BpFixHead *mmBpFixHead = (BpFixHead *)p_data;
		if(mmBpFixHead->bMagicNumber == 0xfe)
		{
			memcpy(p_nus->recv_data.data, p_data, length);
			p_nus->recv_data.Length = BigLittleSwap16(mmBpFixHead->nLength);
			p_nus->recv_data.recvLen += length;
		}
	}
	if((p_nus->recv_data.recvLen >= BigLittleSwap16(mBpFixHead->nLength))&&(mBpFixHead->bMagicNumber == 0xfe))
	{
		wechat_unpack_response(p_nus->recv_data.data);
		switch(BigLittleSwap16(mBpFixHead->nCmdId))
		{
			case ECI_resp_auth:
				ble_nus_send_data(p_nus, ECI_req_init, 0, 0);
			break;
			case ECI_resp_init:
				
			break;
			case ECI_push_recvData:
			
			break;
			case ECI_resp_sendData:
				
			break;

