andyjhf/nrf51822_bluetooth_reader_RC522/App/main.c
        case BLE_GAP_EVT_TIMEOUT:
            if (p_ble_evt->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_ADVERTISEMENT)
            { 
                nrf_gpio_pin_clear(ADVERTISING_LED_PIN_NO);

                // Configure buttons with sense level low as wakeup source.
                nrf_gpio_cfg_sense_input(WAKEUP_BUTTON_PIN,
                                         BUTTON_PULL,
                                         NRF_GPIO_PIN_SENSE_LOW);
                
                // Go to system-off mode (this function will not return; wakeup will cause a reset)
                err_code = sd_power_system_off();    
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief       Function for dispatching a S110 SoftDevice event to all modules with a S110
 *              SoftDevice event handler.
 *
 * @details     This function is called from the S110 SoftDevice event interrupt handler after a
 *              S110 SoftDevice event has been received.
 *
 * @param[in]   p_ble_evt   S110 SoftDevice event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    ble_conn_params_on_ble_evt(p_ble_evt);
    ble_nus_on_ble_evt(&m_nus, p_ble_evt);
    on_ble_evt(p_ble_evt);
}


/**@brief   Function for the S110 SoftDevice initialization.
 *
 * @details This function initializes the S110 SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    // Initialize SoftDevice.
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_XTAL_20_PPM, false);
    
    // Subscribe for BLE events.
    uint32_t err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}

/**@brief  Function for configuring the buttons.
 */
static void buttons_init(void)
{
    nrf_gpio_cfg_sense_input(WAKEUP_BUTTON_PIN,
                             BUTTON_PULL, 
                             NRF_GPIO_PIN_SENSE_LOW);    
}


/**@brief  Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief  Function for initializing the UART module.
 */
static void uart_init(void)
{
    /**@snippet [UART Initialization] */
    simple_uart_config(RTS_PIN_NUMBER, TX_PIN_NUMBER, CTS_PIN_NUMBER, RX_PIN_NUMBER, HWFC);
    
    NRF_UART0->INTENSET = UART_INTENSET_RXDRDY_Enabled << UART_INTENSET_RXDRDY_Pos;
    
    NVIC_SetPriority(UART0_IRQn, APP_IRQ_PRIORITY_LOW);
    NVIC_EnableIRQ(UART0_IRQn);
    /**@snippet [UART Initialization] */
}


/**@brief   Function for handling UART interrupts.
 *
 * @details This function will receive a single character from the UART and append it to a string.
 *          The string will be be sent over BLE when the last character received was a 'new line'
 *          i.e '\n' (hex 0x0D) or if the string has reached a length of @ref NUS_MAX_DATA_LENGTH.
 */
void UART0_IRQHandler(void)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    uint32_t err_code;

    /**@snippet [Handling the data received over UART] */

    data_array[index] = simple_uart_get();
    index++;

    if ((data_array[index - 1] == '\n') || (index >= (BLE_NUS_MAX_DATA_LEN - 1)))
    {
//        err_code = ble_nus_send_string(&m_nus, data_array, index + 1);
        if (err_code != NRF_ERROR_INVALID_STATE)
        {
            APP_ERROR_CHECK(err_code);
        }
        
        index = 0;
    }

    /**@snippet [Handling the data received over UART] */
}
/***************MainCirCleTask*************************/
uint8_t CT[2]; //卡类型
uint8_t SN[4]; //卡号
uint8_t Card_KEY[6] = { 0xff, 0xff, 0xff, 0xff, 0xff, 0xff }; //{0x11,0x11,0x11,0x11,0x11,0x11};   //密码
uint8_t Card_Data[16];

void MainCircleTask(void)
{      
	uint8_t status2,i;
  status2=PcdRequest(0x52,CT);//寻卡,输出为卡类型
  if(status2==MI_OK) //寻卡成功
  {
    simple_uart_putstring("寻卡成功\r\n");
    status2 = PcdAnticoll(SN);  //防冲撞处理，输出卡片序列号，4字节--第0扇区第0块前4个字节是UID（序列号）
  }
  if(status2==MI_OK) //防冲撞成功
  {
    simple_uart_putstring("防冲撞成功\r\n");
			//输出ID号
    simple_uart_putstring("卡号:");
    for(i=0;i<4;i++)
    {
//      simple_uart_putstring("%X ",SN[i]);
    }
    simple_uart_putstring("\r\n");
    status2 = PcdSelect(SN);  //选卡
			
  }
  if(status2==MI_OK) //选卡成功
  {
    simple_uart_putstring("选卡成功\r\n");
    status2 = PcdAuthState(0x60, 5, Card_KEY, SN);//验证卡
  }
  if(status2==MI_OK) //验证卡成功
  {
    simple_uart_putstring("验证卡成功\r\n");
  }else
		simple_uart_putstring("fail\r\n");
}

/**@brief  Application main function.
 */
int main(void)
{
    // Initialize
    leds_init();
    timers_init();
    buttons_init();
    uart_init();
		//p_spi_base_address = spi_master_init(SPI0, SPI_MODE3, false);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    sec_params_init();
    nrf_gpio_cfg_output(SPI_PSELSCK0);
		nrf_gpio_cfg_output(SPI_PSELMOSI0);
		nrf_gpio_cfg_input(SPI_PSELMISO0, NRF_GPIO_PIN_NOPULL);
		nrf_gpio_cfg_output(SPI_PSELSS0);
    simple_uart_putstring(START_STRING);
	
		printf("uart init successfully\r\n");
    
    advertising_start();
	
		MFRC522_Init();
		simple_uart_putstring("init successfully\r\n");
		MainCircleTask();	
    
    // Enter main loop
    for (;;)
    {
        power_manage();
    }
}

/** 
 * @}
 */
